import React from 'react';
import './EssayText.css'; // Use the same CSS for styling consistency

const EssayText = ({text}) => {
  return (
    <div className="essay-text">
        <p>{text}</p>
      <p>
      Почему мы не умеем довольствоваться тем, что у нас есть? Исполняется одно желание, и вслед за ним появляется новое, и так до бесконечности… Именно из-за этой постоянной неудовлетворённости мы никогда не можем быть по-настоящему счастливы. Об этом и размышляет в предложенной для анализа притче русский, советский писатель Ф.Д. Кривин. Автор поднимает проблему недостижимости счастья.
      </p>
      <p>
      В качестве примера Ф.Д. Кривин приводит истории петуха, медведя и человека, которые мечтают о том, чтобы их расколдовали. Петух на самом деле был человеком, но пострадал из-за слишком большой любви к своей жене; медведь родился петухом, но превратился в другое существо из-за собственной ненасытности, а человек, напротив, был медведем, позавидовавшим людям. Таким образом, каждый из них играет роль, которая совершенно не соответствует их истинной сущности, и это мешает им быть счастливыми. Этот пример доказывает, что постоянно растущие потребности препятствуют обретению желанного счастья.
      </p>
      <p>
      Кроме того, интересен и образ «доброго волшебника», который не умеет применять данный от природы дар, потому что не верит в свои способности. Когда по его воле медведь, петух и человек становятся теми, кем были изначально, волшебник не придаёт этому никакого значения. Он твёрдо уверен в том, что «чудес на земле не бывает». С помощью этого примера автор подчёркивает, что неудовлетворённость жизнью – это прямое следствие отсутствия веры в существование счастья.
      </p>
      <p>
      Между приведёнными аргументами прослеживается тесная связь. Дополняя друг друга, они позволяют понять, что стать счастливым невозможно, пока ты не научишься довольствоваться тем, что имеешь, и не обретёшь веру в свои силы.
      </p>
      <p>
      Итогом размышлений писателя Ф.Д. Кривина становится следующая позиция: настоящее чудо – это способность найти своё «я», поверить в себя и быть собой, получая от этого удовольствие вопреки всем обстоятельствам. В этом и заключается секрет подлинного счастья, однако зачастую людям проще смириться с тяготами жизни, чем попытаться что-то изменить.
      </p>
      <p>
      Нельзя не согласиться с точкой зрения автора. Действительно, быть счастливым – непростая задача. Существует слишком много факторов, мешающих нам обрести счастье. Вспомним, например, повесть А.И. Куприна «Олеся», главная героиня которого – девушка, живущая в лесу. Её светлое чувство к другому человеку оказывается взаимным, но из-за сословного неравенства и общественного мнения они не могут быть вместе. Казалось бы, счастье было совсем близко, но страх помешал людям воспользоваться возможностью, которая даётся лишь однажды.
      </p>
      <p>
      В заключение хочется сказать, что проблема недостижимости счастья может быть решена, если люди пересмотрят свои привычки, идеалы и жизненные принципы и начнут прилагать усилия, чтобы прийти к гармонии с собой.
      </p>
      <p>
        Слов 382
      </p>
    </div>
  );
}

export default EssayText;
